---
kind: other
id: Methods.T:Autodesk.Revit.DB.ModelNurbSpline
source: html/32bd84cb-7e99-3d19-2869-c1a599111dc2.htm
---
# ModelNurbSpline Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.